var currentUser; //当前用户
/**
 * 设置用户cookie
 * @param info
 */
function setUserInfo(info) {
    $.cookie("userInfo",null,{ path: '/' });
    $.cookie("userInfo",JSON.stringify(info),{ path: '/' });
}
/**
 * 获取用户cookie
 * @returns {string}
 */
function getUserInfo() {
    if(!currentUser){
        var user = $.cookie('userInfo');
        if (user) {
            currentUser = JSON.parse(user);
        }
        return currentUser;
    } else {
        return currentUser;
    }
}
/**
 * 删除用户cookie
 * @returns {string}
 */
function removeUserInfo() {
    currentUser = null;
    $.cookie("userInfo",null,{ path: '/' });
}

/**
 * 公共请求
 * @param url
 * @param post_data
 * @param callback
 */
function httpRequest(url, post_data, callback) {
    $.ajax({
        type:'post',
        url:url,
        data:toData(post_data),
        success:function(data){
            if (typeof data != 'string' && data.status.code == 316) {
                removeUserInfo();
                window.location.href = "index.html"
            }

            if (typeof data != 'string' && data.status.code !== 200) {
                return callback("FAIL", data);
            }

            return callback("SUCCESS", data);
        }
    })
}
function toData(json) {
    var data = JSON.stringify(json);
    data = aesEncrypt(data);
    return "data=" + data;
}


/**
 * 问题列表
 * @returns
 */
function getQuestionList() {
    var data = [
        {
            id:1,
            title:"什么是己秘?",
            conten:"己秘旨在通过基因检测，让您更了解自己的身体特征，从而帮助指导健康生活。目前主要产品有精准减肥指导、精准护指导、儿童营养需求评估、患病风险预测等。揭开基因秘密，更好了解自己。未来已来！在这个风起云涌，激动人心的时代里己秘将与您一路同行，伴您一生健康!"
        },
        {
            id:2,
            title:"检测准确性如何?",
            conten:"所有的检测结果会经过我们严格的质控程序，我们能够保证超过 99% 的准确率，以保证您获得的原始数据的准确性。<br/>在报告解读层面，我们报告中的项目均根据科研文献的结论得出。但是基因只是影响性状的一部分因素，其他可能的因素包括生活环境和生活方式等。结果会随着科研的进展不断优化。"
        },
        {
            id:3,
            title:"如何保障我的隐私？",
            conten:"己秘承诺除非得到用户授权或依据国家法律要求，己秘不会向任何人或组织转移与用户身份信息直接关联的的样品、样品衍生物和遗传信息。<br/>"+"在剥离个人信息的前提下，己秘将对包括您的数据在内的整个用户数据库进行分析，从而推进科学研究。"
        },
        {
            id:4,
            title:"基因与疾病的关系?",
            conten:"除了外伤，一切疾病均与基因有关。疾病是由内因（基因）和外因（环境）共同决定的。环境包括饮食、生活、行为方式等。对于携带易感基因的人，更容易遭到环境的损害，更易患某种疾病，通过基因检测可以知道是否携带易感基因，从而可以有针对性的改变生活和行为方式、饮食习惯从而保持健康的作用。"
        },
        {
            id:5,
            title:"基因检测可不可以相信?",
            conten:"基因检测是从受检者的口腔上皮脱落细胞、血液等细胞或组织中提取DNA，对受检者的DNA进行检测并进行生物信息学分析，从而得知受检者患某种疾病的风险。世界人类基因组计划成员：中国、法国、日本、美国、英国、德国。基因研究技术居世界领先水平。卫计委对做基因检测的公司有资格认证，并建立了高通量测序技术的临床示范单位，发改委也正式批复了全国建设27个基因检测技术应用示范中心，所以基因检测技术是可信的。"
        },
        {
            id:6,
            title:"若检测出有患病风险怎么办？",
            conten:"疾病是由内因（基因）和外因（环境）共同决定的。环境包括饮食、生活、行为方式等。如本报告显示您有患病的风险，并不意味着您最终会导致疾病的发生，只表明您比大众人群有更高的患病风险。疾病最终的发生取决于您的饮食、生活方式等外因的影响程度。<br/>"+
        "如果检测结果显示您有患病风险，我们希望您在得到这些信息后，保持乐观情绪，心情舒畅；注意释放心理压力，积极调整心态，使您的发病风险降至最低。<br/>"+
        "如果检测结果显示您有患病风险，表明您更容易遭到环境的损害，更易患某种疾病，可以有针对性的调整您的生活方式、行为方式、饮食习惯、体检方案（专项检查）、体检频率，使您更注重预防，懂得怎样预防，针对性的预防，提高自己的生命水平和生活质量，有效的降低健康管理的费用，让未来发生的疾病不发生、少发生或晚发生。<br/>"+
        "好莱坞著名影星安吉丽娜·朱莉通过基因检测，确定携带BRCA1缺陷基因，医生估测她患乳腺癌和卵巢癌的几率分别为87%和50%，2013年，朱莉选择切除了自己的双侧乳腺，这使得她的乳腺癌风险由手术前的87%降到了手术后的5%左右；2015年，在被检测出一侧卵巢出现良性肿瘤后，因担心罹患卵巢癌，又选择了卵巢切除手术。根据Narod团队研究结果，切除卵巢的女性患有卵巢癌的可能性降低了80%，并使卵巢癌引起的死亡可能性降低77%。"
        },
        {
            id:7,
            title:"如果已经得了乳腺癌还需要进行基因检测吗？",
            conten:"乳腺癌易感基因的检测对患者临床的影响主要体现在四个方面：<br/>"+
                    "(a)基因检测对手术的影响<br/>"+
                    "如果你是BRCA阳性，那么，你就有很高的二次乳腺癌和卵巢癌的风险，乳腺癌风险平均10年内为15~40%，而散发患者二次患癌风险为3~10%。因此，突变阳性患者更常做双侧切除手术，而不是保乳手术或者单侧切除手术。BRCA1突变阳性患者有最高达44%的风险患卵巢癌，因此，更有可能进行卵巢切除。<br/>"+
                    "(b)基因检测对用药的影响<br/>"+
                    "例1：如果你是BRCA1阳性，那么，你的乳腺癌是雌激素受体阳性的可能性就比较小，那么，你使用激素治疗就不合适。<br/>"+
                    "例2：针对BRCA阳性敏感的药物：PARP抑制剂Olaparib（奥拉帕尼），澳门已经可以用，因此，突变检测可作为用药指导依据。<br/>"+
                    "(c)基因检测对放疗的影响<br/>"+
                    "BRCA阳性患者对放疗敏感，因此，基因检测可能影响医生对放疗剂量的选择。<br/>"+
                    "(d)基因检测对复发的影响<br/>"+
                    "BRCA阳性患者具有更高的复发率，通过研究发现，使用tamoxifen（他莫昔芬）、raloxifene（雷洛昔芬）等能显著降低同侧及对侧乳腺癌复发风险。<br/>"+
                    "乳腺癌患者接受基因检测对于整个家庭来说是非常重要的意义。检测结果不仅可以解释患癌的原因，辅助完善现行的医疗管理方案，而且有助于其他家庭成员了解自身患癌风险。<br/>"+
                    "而对于其家属：<br/>"+
                    "首先，通过基因检测可以确定家人有没有携带致病基因突变。<br/>"+
                    "其次，如果携带致病基因突变，则需要采取措施提前预防。定时体检或在医生的指导下指定预防方案，做到有病早医，无病早防。<br/>"+
                    "非常有意义，一方面通过基因体检可以知道是不是遗传上有什么风险，可以为病因的查找及疾病的预后有指导作用；另一方面，一种疾病的发生会引起其它疾病的发生，如高血压会带来脑血栓、冠心病等的重要因素，如果基因体检提示有很大的高血压风险，我们也要防范脑血栓、冠心病等的风险。"
        },
        {
            id:8,
            title:"我定期体检或家族无癌症病史，我认为我没有做基因检测的必要，你为什么动员我去你们公司做基因检测？",
            conten:"癌症，通常虽没有表现出明显遗传性，但表现出了明显的家族聚集性，并且它的发生发展是一个相对漫长的过程。有时自己虽尚无症状，但如果亲属有相关疾病，自己就应当引起重视与注意。医院的体检，通常是检测已经出现症状及相应指标升高的情况，但是此时已经罹患癌症，为时已晚。良培基因专业的基因检测是在没有出现明显临床症状时就对自身患癌风险有一个精准的评估，对可能的患癌种类进行一个精准的筛查，并进行针对性的健康管理，尽可能延长癌症的演变时间，将它延迟发生甚至不发生。<br/>"+
                    "相信很多人都是不清楚的，大多数的人只是知道得了癌症要治疗，这个本身是没有什么错的，但是如果我们不知道癌症的发病机制，就可以防癌于未然。良培基因专业的基因检测是在没有出现明显临床症状时就对自身患癌风险有一个精准的评估，对可能的患癌种类进行一个精准的筛查，并进行针对性的健康管理，尽可能延长癌症的演变时间，将它延迟发生甚至不发生。也就是所说的将癌症扼杀在摇篮里，一次检测，防癌于未然！"
        },
        {
            id:9,
            title:"你们公司的检测报告又不能作为临床诊断的标准，为什么要做？",
            conten:"我们公司所做的检测是基因检测，是从受检者的口腔上皮脱落细胞、血液等细胞或组织中提取DNA，对受检者的DNA进行检测并进行生物信息学分析，从而得知受检者患某种疾病的风险。<br/>"+
        "基因检测是人在没发病时，预防将来会发生什么疾病，属于检测的第一阶段；而常规检测是发生疾病后，疾病到达什么程度。<br/>"+
        "所以说，基因检测是主动预防疾病的发生，而传统的体检手段则无法起到这样的预防作用。传统体检主要针对人体已经出现的临床病变进行诊断和检查，它的主要任务是配合疾病的治疗，无法在病变之前预知，下更多、更深的结论。也就是说，在疾病的预防上，传统体检十分的被动和滞后。现实中很多疾病并无明显征兆，而一旦发病，现代医学往往束手无策，患者及其家人就可能一生痛苦和麻烦。基因检测却不同，它的目的就是预防。是在没有病变产生前，通过个人基因缺损与对应疾病的相关度检测分析，给出患病易感度，就是尽量让本来要生病的人不生病或延缓病变。<br/>"+
        "基因检测与目前常规临床检测具有相辅相成的作用，当您查出具有某种疾病的不利基因的时候，积极改善生活方式，预防环境致病因，并到临床做适度的监控，就会避免悲剧发生。<br/>"
        },
        {
            id:10,
            title:"我的检测结果中，没有致病突变，但是有有害突变，是什么意思？以后我都没有患这种病的风险了？",
            conten:"致病突变简单来说就是在临床上报道过可引起相关疾病的发生，说明具有相当大的患病风险，如果说您检查出来有致病突变的话，请您不要过分担心，这只是提示您具有较高的患病风险，我们建议您及时与您的临床医生联系，进行相关的及早的干预措施。或者您在我们公司做检测后，如果有致病突变，我们公司会有专业的健康管理平台，有相关的遗传咨询师和健康管理师对您及您的家人制定个性化的健康生活方式，而且后续还会对您的检测数据进行实时更新；<br/>" +
        "有害突变就是指这些基因突变可能影响蛋白的表达或者改变蛋白的功能，可能会导致某些疾病的发生，但只要您进行及早的预防和干预，可以有效避免后期的致病突变。"
        },
        {
            id:11,
            title:"如果检测结果有致病突变，是不是我就一定会患这种疾病？",
            conten:"如果报告显示您有致病突变，并不意味着您最终会导致疾病的发生，只表明您比普通人群有更高的患病风险。疾病是由内因（基因）和外因（环境）共同决定的。通过检测我们了解了内因，表明您更容易遭到外在环境的损害。疾病最终的发生取决于您的饮食、生活方式等外因的影响程度。可以针对性的调整您的生活方式、行为方式、心理状态，饮食习惯、体检方案（专项检查）、体检频率，使您更注重预防，懂得怎样预防，针对性的预防，让未来发生的疾病不发生、少发生或晚发生。我们的报告中有针对性的健康指导，您可以作为参考。"
        },
        {
            id:12,
            title:"检测结束后，有没有后续的跟踪服务？",
            conten:"您在本公司做了基因检测之后，后期会出具相关的报告，结合国际权威数据库整合支持，使我们的报告更加科学准确，另外报告中会详细的介绍您的具体情况，本公司还具有相关的健康管理平台，该平台会有一个自主查询的功能，包括样本流程跟踪，报告实时在线查询，报告结果等，当然您的信息我们是绝对保密的，在该平台上会有相关的遗传咨询师和健康管理师在线问答，针对客户相关问题提供专业的解答，另外会对每一位受检测者量身定制一套健康合理化的生活方式，让您及您的家人都能够健康的生活。<br/>有专业人员，一对一的个性化健康指导，对于客户提出的健康现状、改善性建议、危险因素的分析以及预防性的指导包括营养结构、生活方式、运动、个性化用药等，根据基因检测报告和体检报告结合您的生活方式，做一个360度的分析与评估。"
        }
    ];

    return data;
}